test/setup_kOmegaSST/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0.1 0.0);

boundaryField
{
    fixedWalls
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0.1 0.0);
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
