test/setup_kOmegaSST/system/simulationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          simulationParameters;
}

NX              3;

GRADSCHEME      Gauss linear;

DIVSCHEME       Gauss upwind;

LAPSCHEME       Gauss linear uncorrected;

// ************************************************************************* //
